IdeaRS.OpenModel.Concrete.BeamDataEc2
Beam data Ec2

IdeaRS.OpenModel.Concrete.BeamDataEc2.#ctor
constructor

IdeaRS.OpenModel.Concrete.BeamDataEc2.TypeOfCalculation
there are several types of calculation

IdeaRS.OpenModel.Concrete.BeamDataEc2.Ln
Length of beam

IdeaRS.OpenModel.Concrete.BeamDataEc2.BeamSpanLength
beam span lengrh - theoretical support distance

IdeaRS.OpenModel.Concrete.BeamDataEc2.TypeOfSupportLeft
Type of support on the left side

IdeaRS.OpenModel.Concrete.BeamDataEc2.TypeOfSupportRight
Type of support on the right side

IdeaRS.OpenModel.Concrete.BeamDataEc2.WidthOfSupportLeft
Width of support on the left side

IdeaRS.OpenModel.Concrete.BeamDataEc2.WidthOfSupportRight
Width of support on the right side

IdeaRS.OpenModel.Concrete.BeamDataEc2.DeflectionSheme
type of span loads

IdeaRS.OpenModel.Concrete.BeamDataEc2.CheckLimitDeflection
indicator for check of limit deflection for beam span

IdeaRS.OpenModel.Concrete.BeamDataEc2.IsUserLimitDeflection
true for user value of limit deflection (both - total + rheological)

IdeaRS.OpenModel.Concrete.BeamDataEc2.UserLimitDeflection
user value of limit deflection - denominator - 1 / value

IdeaRS.OpenModel.Concrete.BeamDataEc2.CheckLimitDeflRheoEffects
true for check of limit deflection for beam span from rheological effects of variable loads

IdeaRS.OpenModel.Concrete.BeamDataEc2.UserLimitDeflRheoEffects
user value of limit deflection from rheological effects of variable loads - denominator - 1 / value

IdeaRS.OpenModel.Concrete.BeamDataEc2.IsAbsValueLimitDeflection
true for absolute user value of limit deflection (both - total + rheological)

IdeaRS.OpenModel.Concrete.BeamDataEc2.RequiredCamber
required camber

IdeaRS.OpenModel.Concrete.BeamDataEc2.IsYDirectionData
true for deflection data in Y direction